export const aboutMe = [
  { content: "הילה כהן, נעים להכיר", bold: false },
  { content: "נשואה ואמא לשלושה ילדים,", bold: false },
  { content: "בעלת תואר ראשון בחינוך לגיל הרך,", bold: false },
  { content: "תואר שני בלימודי משפחה בהתמחות בייעוץ למשפחות,", bold: false },
  { content: "יועצת משפחתית מוסמכת המתמחה בגיל הרך,", bold: true },
  {
    content: "ובעלת ניסיון רב בעבודה עם ילדים, הורים וצוותים חינוכיים.",
    bold: true,
  },
  {
    content: "מעבירה סדנאות והרצאות פרטיות ומנחה מעגלי אימהות בחופשת לידה,",
    bold: true,
  },
  { content: "מלווה ומייעצת להורים לקראת המעבר להורות ובהורות.", bold: true },
  { content: "" },
  {
    content: "המעבר שלנו מיחידים למשפחה הוא אף פעם לא מסע קל,",
    bold: false,
  },
  {
    content: "ולמרות מה שחושבים – הוא לא מתחיל רק כאשר התינוק נולד...",
    bold: false,
  },
  {
    content: "המסע המיוחד שלנו כהורים מתחיל כבר ברגע בו",
    bold: true,
  },
  {
    content: "אנחנו מגלים שאנחנו עתידים להיות הורים.",
    bold: true,
  },
  { content: "" },
  { content: "אז צצות להן שאלות:", bold: false },
  { content: '"איך נחנך?"', bold: false },
  { content: '"איפה נגור?"', bold: false },
  { content: '"מי יקום להחליף חיתול בלילה?",', bold: false },
  { content: '"להניק או לא להניק?"', bold: false },
  { content: 'ואפילו, "איזו סבתא תבוא לעזור?"', bold: false },
  { content: "כדי לפתור את כל סימני השאלה האלה ועוד רבים אחרים", bold: true },
  {
    content: "ועל מנת הכין קרקע בטוחה, מכילה ואוהבת לתינוק שמצטרף למשפחה,",
    bold: true,
  },
  {
    content: "אני מלווה ומייעצת להורים לקראת המעבר להורות, וכן בהורות עצמה,",
    bold: true,
  },
];
