export const aboutMe = [
  { content: "הילה כהן, נעים להכיר", bold: false },
  { content: "נשואה ואמא לשלושה ילדים,", bold: false },
  { content: "בעלת תואר ראשון בחינוך לגיל הרך,", bold: false },
  { content: "תואר שני בלימודי משפחה בהתמחות בייעוץ למשפחות,", bold: false },
  { content: "יועצת משפחתית מוסמכת המתמחה בגיל הרך,", bold: true },
  {
    content: "ובעלת ניסיון רב בעבודה עם ילדים, הורים וצוותים חינוכיים.",
    bold: true,
  },
  {
    content: "מעבירה סדנאות והרצאות פרטיות ומנחה מעגלי אימהות בחופשת לידה,",
    bold: true,
  },
  { content: "מלווה ומייעצת להורים לקראת המעבר להורות ובהורות.", bold: true },
  { content: "" },
  {
    content: "המעבר שלנו מיחידים למשפחה הוא אף פעם לא מסע קל,",
    bold: false,
  },
  {
    content: "ולמרות מה שחושבים – הוא לא מתחיל רק כאשר התינוק נולד...",
    bold: false,
  },
  {
    content: "המסע המיוחד שלנו כהורים מתחיל כבר ברגע בו",
    bold: true,
  },
  {
    content: "אנחנו מגלים שאנחנו עתידים להיות הורים.",
    bold: true,
  },
  { content: "" },
  { content: "אז צצות להן שאלות:", bold: false },
  { content: '"איך נחנך?"', bold: false },
  { content: '"איפה נגור?"', bold: false },
  { content: '"מי יקום להחליף חיתול בלילה?",', bold: false },
  { content: '"להניק או לא להניק?"', bold: false },
  { content: 'ואפילו, "איזו סבתא תבוא לעזור?"', bold: false },
  { content: "כדי לפתור את כל סימני השאלה האלה ועוד רבים אחרים", bold: true },
  {
    content: "ועל מנת הכין קרקע בטוחה, מכילה ואוהבת לתינוק שמצטרף למשפחה,",
    bold: true,
  },
  {
    content: "אני מלווה ומייעצת להורים לקראת המעבר להורות, וכן בהורות עצמה,",
    bold: true,
  },
  {
    content: "מעבירה סדנאות והרצאות פרטיות וכן מנחה מעגלי אימהות בחופשת לידה.",
    bold: true,
  },
  {
    content: "אבל ברור לנו שהמסע שלנו לא נגמר כאן...",
    bold: false,
  },
  {
    content: "גם אם ביצענו את המעבר מיחידים להורים בצורה הטובה ביותר,",
    bold: false,
  },
  {
    content: "התכוננו, קראנו, למדנו, ואפילו התנסנו על האחיינים - ",
    bold: false,
  },
  {
    content: "השנים הראשונות של הילד בבית הן המאתגרות ביותר!",
    bold: true,
  },
  {
    content: "",
    bold: true,
  },
  {
    content: 'פתאום יש "בוס" חדש בבית שמנהל לנו את זמני המקלחת,',
    bold: false,
  },
  {
    content: "שעות הארוחה וגם בלילה דואג להזכיר לנו שהקול שלו נשמע. נשמע היטב.",
    bold: false,
  },
  {
    content: "בין אם נודה ובין אם לא, המצב החדש מוביל להמון אתגרים,",
    bold: false,
  },
  {
    content: "חלוקת תפקידים קשוחה, ולעיתים אף לויכוחים וריבים בין בני המשפחה.",
    bold: false,
  },
  {
    content: "חשוב תמיד לזכור שלכל ילד יש את האופי הייחודי שלו,",
    bold: true,
  },

  {
    content: "ולא תמיד זה משתלב בצורה האופטימלית ",
    bold: true,
    color: "red",
  },
  {
    content: "עם הצרכים שלנו או של בני משפחה אחרים.",
    bold: true,
    color: "red",
  },
  {
    content: "בגלל זה, כשאני מייעצת למשפחות,",
    bold: false,
    color: "red",
  },

  {
    content: "אני קודם כל רואה את הילד כחלק ממערכת משפחתית מורכבת",
    bold: false,
  },
  {
    content: "ושמה במוקד ההתערבות את הקשרים ומערכות היחסים בין בני המשפחה.",
    bold: false,
  },
  {
    content: "הייעוץ שלי הוא מדויק וממוקד מטרה ולכן גם קצר מועד.",
    bold: true,
  },

  {
    content: "אני מזמינה אתכם לצאת יחד איתי לדרך משמעותית ומקדמת",
    bold: true,
    color: "pink",
  },
  {
    content: "להורות המיטבית והייחודית שלכם שתיצור אווירה נעימה ורגועה בבית",
    bold: true,
    color: "pink",
  },
  {
    content: "ותעניק לילדים שלכם את הטוב ביותר!",
    bold: true,
    color: "pink",
  },
];

export const WhyWorkWithMe = [
  {
    title: { content: "כלים פרקטיים", bold: true },
    content: {
      content:
        "אני מדייקת את הליווי, ייעוץ וההרצאות שלי לצרכים שלכם על מנת להעניק לכם כלים פרקטיים שישמשו אתכם מיידית בהורות שלכם ובהתנהלות בבית",
    },
  },
  {
    title: { content: "קצר מועד", bold: true },
    content: {
      content:
        "אנחנו לא נכנסים לתהליך שייקח שנים... ברור לי שהזמן שלכם חשוב ואתם רוצים תוצאות! אני מתאימה את עצמי לצרכים שלכם ולערכי המשפחה שלכם כדי להעניק לכם פתרונות בזמן הקצר ביותר",
    },
  },
  {
    title: { content: "התאמה אישית", bold: true },
    content: {
      content:
        "ההרצאות, הסדנאות וכך גם הייעוץ והליווי הפרטני שלי מותאמים אליכם, לערכים שלכם, לרצונות ולצרכים שלכם. אני מדייקת את עצמי לאתגרים איתם אתם מתמודדים כדי להעניק לכם ערך וכלים מותאמים",
    },
  },
  {
    title: { content: "גמישות במיקום", bold: true },
    content: {
      content:
        "ניתן לבצע איתי תהליכים הן בזום והן בקליניקה בהתאם לשיקולכם והעדפתכם האישית. בנוסף, את ההרצאות והסדנאות ניתן לקיים בבית, במשרד או בכל מקום אחר שתבחרו",
    },
  },
  {
    title: { content: "יועצת בגישה מערכתית", bold: true },
    content: {
      content:
        "אני מתמחה בגיל הרך ויועצת בגישה מערכתית השמה במוקד ההתערבות את המערכת המשפחתית ובכך מעניקה לכם כלים שיעזרו לשפר את החיים והאווירה בבית בצורה משמעותית וגם להעניק לילד את מה שהוא באמת צריך",
    },
  },
];

export const HomepageAboutMe = [
  { content: "הילה כהן, נעים להכיר", bold: false },
  { content: "נשואה ואמא לשלושה ילדים,", bold: false },
  { content: "בעלת תואר ראשון בחינוך לגיל הרך,", bold: false },
  { content: "תואר שני בלימודי משפחה בהתמחות בייעוץ למשפחות,", bold: false },
  { content: "יועצת משפחתית מוסמכת המתמחה בגיל הרך,", bold: true },
  {
    content: "ובעלת ניסיון רב בעבודה עם ילדים, הורים וצוותים חינוכיים.",
    bold: true,
  },
  {
    content: "מעבירה סדנאות והרצאות פרטיות ומנחה מעגלי אימהות בחופשת לידה,",
    bold: true,
  },
  { content: "מלווה ומייעצת להורים לקראת המעבר להורות ובהורות.", bold: true },
];
