export const personalConsultData: {
  intro: { content: string; bold?: boolean; color?: string }[];
  tools?: {
    icon: JSX.Element;
    title: { content: "העצמת הסמכות ההורית"; bold: true };
    content: {
      content: "הבנת הכוח שלנו כהורים ויצירת סמכות הורית בבית תוך חיזוק מערכת היחסים עם הילד";
    };
  }[];
} = {
  intro: [
    {
      content: '"הילד לא אוכל ירקות, מה עושים?!"',
      bold: false,
    },
    {
      content: '"הילדה כבר בת 4 ואנחנו לא מצליחים להיפטר מהחיתול בלילה",',
      bold: false,
    },
    {
      content: '"הילד משתטח באמצע הרחוב אם אנחנו לא מקשיבים לו",',
      bold: false,
    },
    {
      content: '"למה כל מקלחת צריכה להוביל לצרחות וריבים?!",',
      bold: false,
    },
    {
      content: '"איך אפשר ליצור אווירה רגועה יותר בבית?!"',
      bold: false,
    },
    {
      content: "",
    },
    {
      content: "כל אלה הן שאלות לגיטימיות לחלוטין שאני שומעת מהורים רבים...",
      bold: false,
    },
    {
      content: "האמת היא שכשנכנסתם לנעליים הגדולות האלה של להיות הורים,",
      bold: false,
    },
    {
      content: "לא בהכרח חשבתם שזה יהיה כזה מסובך.",
      bold: false,
    },
    {
      content: "היו לכם ציפיות מההורות שלכם, מהילדים שלכם,",
      bold: true,
    },
    {
      content: "רציתם להיות רגועים איתם, לא להתעצבן,",
      bold: true,
    },
    {
      content: "הייתם בטוחים שהילד שלכם יהיה רגוע וקשוב - ",
      bold: true,
    },
    {
      content: "ואז המציאות הוכיחה שלא תמיד דברים מתנהלים כמו שקיוויתם.",
      bold: true,
    },
    {
      content: "החדשות הטובות הן שאתם לא לבד!",
      bold: false,
    },
    {
      content: "",
    },
    {
      content: "הורים רבים מתמודדים עם קשיים ואתגרים בהורות ",
      bold: true,
    },
    {
      content: "במיוחד בשנים הראשונות של הילד.",
      bold: true,
    },
    {
      content: "האמת היא שאנחנו מוצפים במידע ובהכוונה",
      bold: false,
    },
    {
      content: '"איך להיות הורה מדהים!" ו"מה כדאי או מה אסור לעשות", ',
      bold: false,
    },
    {
      content:
        "ולעיתים קשה לנו להבין מה נכון לנו כהורים, מה נכון לילד ולמשפחה שלנו.",
      bold: false,
    },
    {
      content: "אני מאמינה שהדרכה פרטית המותאמת לערכי המשפחה",
      bold: true,
    },
    {
      content:
        "ונעשית בתהליך ממוקד הנותן מענה לצרכים ולרגשות של כלל חברי המשפחה - ",
      bold: true,
    },
    {
      content:
        "זו הדרך הנכונה להשיג את המטרה ולעשות את הטוב ביותר עבור המשפחה שלכם!",
      bold: true,
    },

    {
      content:
        "הייעוץ שלי ניתן במגוון תחומים הנוגעים להתמודדות עם ילדים בגיל הרך,",
      bold: false,
    },
    {
      content: "לקשיים ואתגרים במשפחה ומול הילד, כמו לדוגמא:",
      bold: false,
    },
  ],
};
